{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Crow",
    "description": "",
    "home_page_url": "https://thecrow.uk",
    "feed_url": "https://thecrow.uk/feed.json",
    "user_comment": "",
    "icon": "https://thecrow.uk/media/website/the_crow_new_banner-3.png",
    "author": {
        "name": "David Rutland"
    },
    "items": [
        {
            "id": "https://thecrow.uk/service-model-by-adrian-tchaikovsky-a-darkly-tragic-comedy-of-civilisations-end/",
            "url": "https://thecrow.uk/service-model-by-adrian-tchaikovsky-a-darkly-tragic-comedy-of-civilisations-end/",
            "title": "Service Model by Adrian Tchaikovsky - a tar-black comedy of civilisation&#x27;s end",
            "summary": "While it's not explicitly stated when Adrian Tchaikovsky's 2025 novel, Service Model, takes place, the use of the word \"yeet\" as a verb in the context of energetically throwing something, indicates that the events are not too far in the future. Spoilers ahead When we&hellip;",
            "content_html": "<p>While it's not explicitly stated when Adrian Tchaikovsky's 2025 novel, Service Model, takes place, the use of the word \"yeet\" as a verb in the context of energetically throwing something, indicates that the events are not too far in the future.</p>\n<p><em><strong>Spoilers ahead</strong></em></p>\n<p>When we started reading Service Model a few days into July 2025, we had just heard reports that <a href=\"https://www.theregister.com/2025/07/02/microsoft_layoffs/\">Microsoft was about to dismiss 9,000 workers across the business</a>. The news came a mere fortnight after the <a href=\"https://www.theregister.com/2025/05/13/microsoft_layoff/\">Redmond entity announced a 7,000 head layoff</a>, having already ditched <a href=\"https://www.theregister.com/2025/01/09/microsoft_cutting_more_jobs/\">one percent of its staff at the start of the year</a>.</p>\n<p>This isn't unusual in the industry, and it isn't unusual for Microsoft. It's particularly unsurprising as part of the gradual deflation that followed the pandemic boom.</p>\n<p>Take into account the unfortunate and unsurprising, yet entirely plausible, 2023 <a href=\"https://www.goldmansachs.com/insights/articles/generative-ai-could-raise-global-gdp-by-7-percent.html\">Goldman Sachs</a> prediction that AI could replace 300 million jobs and two thirds of all roles over the next decade (the actual article title is \"Generative AI could raise global GDP by 7%\"), and you've made it somewhere towards the starting conditions of Tchaikovsky's vision of the future.</p>\n<p>The extreme wealth inequality that is currently accelerating in 2025, has been dragged past its limit in Tchaikovsky's world, and in turn, the world has come tumbling down.</p>\n<p>AIs and robots perform most tasks for the extremely wealthy. None of them appear to be particularly good at their allotted jobs, but they're good enough, and sometimes that's all that matters.</p>\n<p>Never mind the gross inefficiencies, makework, and self-defeating ends that stem from a situation where fancy statistical engines make up 100 percent of the workforce - someone, somewhere becomes fractionally wealthier (perhaps even by seven percent) with each turn of the screw that forces the rest of humanity into the dirt.</p>\n<h2>The main plot is secondary and the lessons of Service Model are not subtle.</h2>\n<p>While the opening pages don't make it immediately obvious that we, the readers, are riding secondary waves behind the tsunami of the apocalypse, along with our protagonist, it soon becomes obvious.</p>\n<p>Our hero - or at least the valet robot we're following - has killed its master. The master isn't given a name, but the robot is called Charles. Charles doesn't know why he sliced his master's throat from ear to ear before leaving him on the bed and continuing with his task list. This forms Charles's central mystery. Not his motivation, though - or even an item on his task list.</p>\n<p>After being stripped of his name, Charles is sent to be diagnosed and decommissioned.</p>\n<p>From the police units conducting the investigation, through to the diagnostics facility, we are provided with instance after instance of the shortcomings of robots, and the shortsightedness of not only their human designers, but also the people and corporate entities that who brought this situation about.</p>\n<p>The AIs and robots aren't really able to generate or create anything new, and they aren't generally able to alter either their task lists or programming, so are unable to adapt effective solutions to changed circumstances in a way that makes sense or is in any way effective.</p>\n<p>As we traverse the world - across what seems to be mainland Britain, but may not be -Tchaikovsky gives us case studies of why this or that great endeavour fails: librarians that digitally store the contents of work by binary digit in alphabetical order before destroying the originals; self-replicating armies that scavenge spare parts from other units, and continually fight - even though there does not ever seem to ever have been a war; a robotic judge - the most advanced and capable model we see - that has a sense of justice derived from the sensibilities of its mansion-dwelling ruling class creators.</p>\n<p>These tableaux are what we're meant to be looking at - not UnCharles's journey towards an impossible self awareness.</p>\n<p>Humans still exist after the collapse, of course, and where they appear, they too serve as lessons. Beyond the spark of hope, curiosity, and heart-breaking roguish desperation provided by a teenage girl known as 'The Wonk,' who acts as UnCharles's initial saviour and companion for most of the book, we see examples of Mad Max style, desperately poor, hardscrabble settlements, inhabited by the descendants of stockbrokers and accountants. There's a supposedly historically accurate farm, where thousands of 'volunteers' work 8 to 6 in offices, performing pointless tasks bookended with a pointless commute designed to make them as miserable as possible, and administered by a selfish autocrat who delights in inflicting the most mundane suffering. Does this seem like a dig at return-to-office mandates? It did to me. </p>\n<p>The world belongs to robots, but the characters are people. Our protagonist is no protagonist at all, and how can character development occur when the main character has none. It is UnCharles's part-time human companion that is on a quest for meaning.</p>\n<h2>A comedy, you say?</h2>\n<p>Despite the prophetic but not serious death-of-civilisation-for-mundane reasons vibe, Service Model is a funny book. The use of \"yeet,\" as noted above, made me chuckle, and there's a fantastic courthouse scene that put me in mind of Ghostbusters II, but most of the comedy is of a slapstick nature, and speaks of unintended consequences of ill-considered actions.</p>\n<p>Sure, it isn't objectively funny to think that the setting of this book is the result of people being replaced by automation without a safety net, but it also kind of is, in a sort of facepalm \"that sounds about right\" way.</p>\n<p>The robots own efforts to continue with their tasks in the absence of human guidance is where the comedy really is. They conform to the letter of their programming, with solutions completely at odds with their original purpose. Again, it's facepalm humour, but it fits, elicits chuckles where appropriate, and as our protagonists leave each situation behind, we're already darkly looking forwards to the next.</p>\n<p>Adrian Tchaikovsky loves his novels to close out with a thread of hope and interspecies cooperation, and if you've read any of his work before, you'll have a pretty good idea as to how the novel will end.<br><br></p>\n<h2>Should you read Service Model by Adrian Tchaikovsky?</h2>\n<p>In a word, yes. The Crow is giving Service Model a <strong>5/5</strong> rating. You can b<a href=\"https://amzn.to/44KLnHj\" target=\"_blank\" rel=\"noopener noreferrer\">uy the book as either an e-book, physical media, or an audiobook from Amazon</a> (affiliate link).</p>\n<p>For the avoidance doubt, this review was <a href=\"https://thecrow.uk/not-by-ai-a-badge-to-say-youre-mostly-human/\">written by a human, not by AI</a>.</p>",
            "image": "https://thecrow.uk/media/posts/96/service_model.png",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Cool Things",
                   "Books",
                   "AI"
            ],
            "date_published": "2025-07-12T16:12:20+01:00",
            "date_modified": "2025-07-14T22:49:44+01:00"
        },
        {
            "id": "https://thecrow.uk/gamebox-300-barrels-of-emulated-fun-with-some-significant-drawbacks/",
            "url": "https://thecrow.uk/gamebox-300-barrels-of-emulated-fun-with-some-significant-drawbacks/",
            "title": "The Gamebox 300 is a Game Boy Color - with extras",
            "summary": "Walk past a GB300 lying on a table, and you'll be immediately overcome by the urge to pick it up and start playing Pokemon. The similarities to a Game Boy Color are apparent straight away. There's the brightly coloured case (or there would be if&hellip;",
            "content_html": "<p>Walk past a GB300 lying on a table, and you'll be immediately overcome by the urge to pick it up and start playing Pokemon.</p>\n<p>The similarities to a Game Boy Color are apparent straight away. There's the brightly coloured case (or there would be if we hadn't bought a black one), the small screen, the D-pad, and the familiar selection of buttons in the right places. If do you notice a difference, it's that the speaker grille is more reminiscent of the OG Game Boy than its successors. </p>\n<p>And in the age of rechargeables and fast power delivery, you'll eventually find that you still have to change the batteries.</p>\n<h2>Gamebox 300 is a retro pirate's dream machine</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/1/gamebox_recent_history.png\" alt=\"Gamebox 300 history menu with game titles\" width=\"1600\" height=\"800\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-xs.png 300w ,https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-sm.png 480w ,https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-md.png 768w ,https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-lg.png 1024w ,https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-xl.png 1360w ,https://thecrow.uk/media/posts/1/responsive/gamebox_recent_history-2xl.png 1600w\"></figure>\n<p>Inspect the box of this pseudo-Game Boy comes in, and you'll notice that it actually says \"Gamebox 300 Seven Simulator 6000+,\" and this latter number refers to the number of games that come preloaded on the bundled micro SD card. And unlike the models that you might find in your local Home Bargains or B &amp; M, most of these are titles you'll recognise, and that you may have already played.</p>\n<p>A quick perusal shows us all of the Pokemon titles through to third gen, various fighting games including the Street Fighter and Mortal Kombat series, Civilization, the Road Rash saga, and even Sim City.</p>\n<p>This is because - if you haven't already guessed - the Gamebox 300 is an emulation platform, with support for the NES, SNES, Game Boy, Game Boy Color, Game Boy Advance, MAME, and PCEngine.</p>\n<p>Handheld dedicated emulation stations are not a new thing, and we've previously covered <a href=\"https://thecrow.uk/cheap-portable-retro-gaming-with-a-hated-handheld/\">using the Leapfrog Leapster GS as a retro gaming platform</a>, but the differences between the two are plenty.</p>\n<p>First up is the convenience of those 6000+ pre-loaded titles. Sure, antique console ROMs are easy enough to get hold of, but having them tested and ready to go is valuable in itself. Just turn the thing on and get going.</p>\n<p>The Game Boy-esque form-factor is also an improvement over the Leapster. It's easy to fit into your back pocket, and whip out for a few moments of fun while waiting in the queue at Aldi.</p>\n<p>Menu systems are uncomplicated and easy to navigate, and you can browse your stored ROMs by platform, use the handy search function, or even browse your recent history to pick up where you left off.</p>\n<p>Potentially best of all, the console has composite video out, meaning you can hook it up to your TV and play on the big screen. </p>\n<p>With the supplied rechargeable battery, we managed to play for around eight hours. Not in a single sitting, you understand - we do have other things to do. </p>\n<h2>Great execution, but some pain points</h2>\n<p>You'll note that while we have mentioned rechargeable batteries, we haven't yet mentioned the means by which you charge them.</p>\n<p>The Game Box 300 is equipped with a USB-C port on the right-hand-side of its top edge - it's a standard feature of most gadgets in 2025 - and a step up from the four AAs you need to power the Leapster.</p>\n<p>It also comes with a (very) short USB-C cable.</p>\n<p>Use the supplied cable, or a high-end dedicated PD cable, and the Gamebox will charge resonably quick and without problems. If you use an intermediate grade cable, the charging circuit will die. It will never work again.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/1/gamebox_battery_18650.png\" alt=\"An 18650 battery in the gamebox\" width=\"1600\" height=\"800\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-xs.png 300w ,https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-sm.png 480w ,https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-md.png 768w ,https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-lg.png 1024w ,https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-xl.png 1360w ,https://thecrow.uk/media/posts/1/responsive/gamebox_battery_18650-2xl.png 1600w\"></figure>\n<p>When this inevitably happens, you have the option of unscrewing and opening the back to remove and charge the 800 mAH 18650 that you'll find within.</p>\n<p>For an old-school vape fiend like the Crow, this isn't a problem as we have a load of compatible charging equipment. In fact, it's a great opportunity to swap out the the low-capacity unit for a higher-rated 3000 mAH battery. People without an array of spare 18650 chargers to hand, though, will be out of luck.</p>\n<p>Saving from within the games themselves also seems to be impossible. so if you're merrily progressing through your RPG of choice (Final Fantasy III, natch), and saving using the inbuilt mechanism, you'll find that after rebooting the system, your progress is gone. This isn't the end of the world, as its possible to save the entire system state using the console menu, and you'll have four save slots for each game.</p>\n<p>Our final gripe - and this relates solely to using the Gamebox as a Game Boy substitute - is the lack of a link option. You can't connect to another Gamebox owner to trade Pokemon, meaning that some evolutions are out of reach.</p>\n<h2>It's hard to get hold of a Gamebox 300</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/1/damacoola_gambox_300_box.png\" alt=\"\" width=\"1920\" height=\"1112\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-xs.png 300w ,https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-sm.png 480w ,https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-md.png 768w ,https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-lg.png 1024w ,https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-xl.png 1360w ,https://thecrow.uk/media/posts/1/responsive/damacoola_gambox_300_box-2xl.png 1600w\"></figure>\n<p>While the console was briefly available on Amazon, virtually every trace of it has disappeared - either due to its obvious shortcomings leading to an unacceptable return rate, or because of the obvious and egregious copyright violation that go into marketing it.</p>\n<p>Either way, there are only a few references to the Gamebox 300 online (It's apparently made by Damacoola), although they do occasionally crop up on eBay. We paid £4.80 for ours in an in-person transaction and consider it money well spent. If we'd paid the supposed original price of £23.99, we would probably feel a little disappointed.</p>\n<h2>You don't need dedicated hardware to emulate old games</h2>\n<p>Of course, if you want to run old Game Boy games, there's no need to buy new handheld - or even repurpose kid's consoles. You can even <a href=\"https://thecrow.uk/emulate-classic-game-boy-action-in-the-linux-terminal/\">play classic Game Boy titles in the Linux terminal</a>.</p>\n<p> </p>",
            "image": "https://thecrow.uk/media/posts/1/gamebox.png",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Stuff",
                   "Retro",
                   "Hardware",
                   "Emulation",
                   "Cool Things"
            ],
            "date_published": "2025-06-12T12:23:00+01:00",
            "date_modified": "2025-07-14T17:11:55+01:00"
        },
        {
            "id": "https://thecrow.uk/print-your-way-through-the-zombie-apocalypse/",
            "url": "https://thecrow.uk/print-your-way-through-the-zombie-apocalypse/",
            "title": "Print your way through the zombie apocalypse",
            "summary": "Zombies aren't something we usually worry about at the crow's nest. But they're an ever present possibility, and the upcoming release of 28 Years Later - another no-doubt disappointing sequel to the classic 28 Days later - has us wondering how we'd fare if the&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Zombies aren't something we usually worry about at the crow's nest. But they're an ever present possibility, and the upcoming release of 28 Years Later - another no-doubt disappointing sequel to the classic 28 Days later - has us wondering how we'd fare if the zombie apocalypse came to pass.</p>\n<p>Yes, zombies would definitely be a danger but there's the complete collapse of society, infrastructure, and civilisation to think of, too. No power, no running water, no food.</p>\n<p>It's always worth preparing for the worst, and as <a href=\"https://thecrow.uk/elegoo-neptune-4-max-large-format-3d-printer-review-at-homeneed-at-home/\">we have a large-format 3D printer squirreled away in our lair</a>, printing the gear we would need to survive events triggered by a horde of brain-eating former hums should be both simple and cheap.</p>\n<p>This is what we decided we'd need:</p>\n<h2>A bicycle</h2>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/bike_frame.png\" alt=\"Screenshot of a thingiverse page showing a printed bike frame\" width=\"1263\" height=\"656\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/bike_frame-xs.png 300w ,https://thecrow.uk/media/posts/95/responsive/bike_frame-sm.png 480w ,https://thecrow.uk/media/posts/95/responsive/bike_frame-md.png 768w ,https://thecrow.uk/media/posts/95/responsive/bike_frame-lg.png 1024w ,https://thecrow.uk/media/posts/95/responsive/bike_frame-xl.png 1360w ,https://thecrow.uk/media/posts/95/responsive/bike_frame-2xl.png 1600w\"></figure>\n<p>Cities are a dangerous place to be when there are zombies about. If there's a single zombie in your neighbourhood, you can be sure that more people will become infected, then suddenly there are dozens, hundreds, thousands even - all looking for fresh brains to eat and people to infect.</p>\n<p>Getting out of town is the best option, and with the roads doubtless jammed with traffic, a bicycle is a great way to get you there.</p>\n<p>There are hundreds of bicycle designs you can print, but most of them are miniatures, and scaling up won't leave you with a working two-wheeled conveyance.</p>\n<p>Rather than printing an entire, full-sized bicycle, it's a better idea to print the parts that will allow you to build a frame from scavenged materials.</p>\n<p><a href=\"https://www.thingiverse.com/thing:892442\" data-md-href=\"https://www.thingiverse.com/thing:892442\" rel=\"noopener noreferrer nofollow\">ColorFabb's 3D Printed bike</a> aims to do just that - proving joints into which you can slot frame tubes gears and the rest of what makes a bicycle. As we already have a stable of bikes out back, we're all ready to to. Make sure you are, too.</p>\n<h2>Fishing rod</h2>\n<p>After an exhausting ride to a secluded brook in the countryside you're likely to be exhausted and in need of sustenance. Fish are easy to come by but difficult to catch without a rod.</p>\n<p>On the other hand, a rod is bulky, difficult to carry, and will likely attract the attention of the roving hordes.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/sharky.png\" alt=\"Blue and white Sharky fishing reel on a black background\" width=\"1920\" height=\"1290\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/sharky-xs.png 300w ,https://thecrow.uk/media/posts/95/responsive/sharky-sm.png 480w ,https://thecrow.uk/media/posts/95/responsive/sharky-md.png 768w ,https://thecrow.uk/media/posts/95/responsive/sharky-lg.png 1024w ,https://thecrow.uk/media/posts/95/responsive/sharky-xl.png 1360w ,https://thecrow.uk/media/posts/95/responsive/sharky-2xl.png 1600w\"></figure>\n<p>The Sharky fishing rod, isn't actually a rod. It's fish-catching gear that's small enough to fit into your back pocket. It comprises a reel with a locking mechanism, and a quick release. There's also a hole for a carabiner in case you want to clip it to your belt. We built the Sharky - which is currently on V5 - but have yet to catch any fish. We put this down to our own lack of skill, rather than any inherent fault in the design. It's quick, easy, and we see know reason why it shouldn't work.</p>\n<h2 data-pm-slice=\"1 1 []\">A solar still</h2>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/solar_still.png\" alt=\"\" width=\"576\" height=\"395\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/solar_still-xs.png 300w ,https://thecrow.uk/media/posts/95/responsive/solar_still-sm.png 480w ,https://thecrow.uk/media/posts/95/responsive/solar_still-md.png 768w ,https://thecrow.uk/media/posts/95/responsive/solar_still-lg.png 1024w ,https://thecrow.uk/media/posts/95/responsive/solar_still-xl.png 1360w ,https://thecrow.uk/media/posts/95/responsive/solar_still-2xl.png 1600w\"></figure>\n<p>Clean water is a must, and who knows what's died jut around the bend upstream of your little camp.</p>\n<p>Solar stills purify water using the sun’s energy to mimic the natural water cycle through evaporation and condensation.</p>\n<p>Depending on where you are in the world, the amount of water you get out of it will vary.</p>\n<p><a href=\"https://www.thingiverse.com/thing:3060478\" data-md-href=\"https://www.thingiverse.com/thing:3060478\" rel=\"noopener noreferrer nofollow\">Super Steve's survival distiller</a> certainly looks the part, and requires mason jars, plastic piping, a computer fan, and either batteries or solar panels to run.</p>\n<h2 data-pm-slice=\"1 1 []\">Bows and Crossbows</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/sailfish.jpg\" alt=\"A blue and white repeating crossbow on a table\" width=\"1600\" height=\"800\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/sailfish-xs.jpg 300w ,https://thecrow.uk/media/posts/95/responsive/sailfish-sm.jpg 480w ,https://thecrow.uk/media/posts/95/responsive/sailfish-md.jpg 768w ,https://thecrow.uk/media/posts/95/responsive/sailfish-lg.jpg 1024w ,https://thecrow.uk/media/posts/95/responsive/sailfish-xl.jpg 1360w ,https://thecrow.uk/media/posts/95/responsive/sailfish-2xl.jpg 1600w\"></figure>\n<p>Regardless of how peace-loving you are, at some point you're going to need weaponry. Maybe you're retreating from the undead as they come for you or maybe, you're getting tired of eating fish every day.</p>\n<p>Recent years have seen a plethora of new and innovative crossbow designs proliferating, and our favourite is the <a href=\"https://cults3d.com/en/3d-model/various/slinghammer-repeating-slingshot-slingbow-crossbow-pistol-gun-for-8mm-steel-balls-dondipper\">Slinghammer </a>and it's variants.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/slinghammer.png\" alt=\"A cocked repeating crossbow on a table\" width=\"1296\" height=\"648\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/slinghammer-xs.png 300w ,https://thecrow.uk/media/posts/95/responsive/slinghammer-sm.png 480w ,https://thecrow.uk/media/posts/95/responsive/slinghammer-md.png 768w ,https://thecrow.uk/media/posts/95/responsive/slinghammer-lg.png 1024w ,https://thecrow.uk/media/posts/95/responsive/slinghammer-xl.png 1360w ,https://thecrow.uk/media/posts/95/responsive/slinghammer-2xl.png 1600w\"></figure>\n<p>Originally designed to chuck ball bearings of of to 12 mm diameter using an 80-lb off-the-shelf pistol crossbow limb, the Slinghammer is a repeating crossbow, meaning you can cock and reload it quickly, using a lever to slide the magazine forward, catch the string, and return it.</p>\n<p>If you're using ball bearings, you have a 40-ish shot magazine, which you can empty in under a minute. It's fast, and you really wouldn't want to be hit by one of these.</p>\n<p>If you want to up your lethality, you can try the <a href=\"https://cults3d.com/en/3d-model/various/slinghammer-convertion-kit-7-shoot-arrow-magazine\">Slinghammer conversion kit</a>, which fires either 7.5-inch or 6.5-inch bolts. Would it kill a zombie? Maybe. Would it absolutely ruin its day? 100%.</p>\n<p>Using the 7.5\" bolts from the powerstroke model, we've gone clean through a roasting joint. We doubt it would go through bone though. The powerstroke package will give you an eight-bolt mag - which you can empty in about 10 seconds. We've not timed, but that feels about right.</p>\n<p>The standard bolt chucker is less powerful as it has a shorter stroke, but comes with option of a 20-shot doublestack magazine.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/95/schwertwal.png\" alt=\"A black and white repeating crossbow next to a chronograph at night\" width=\"1600\" height=\"800\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/95/responsive/schwertwal-xs.png 300w ,https://thecrow.uk/media/posts/95/responsive/schwertwal-sm.png 480w ,https://thecrow.uk/media/posts/95/responsive/schwertwal-md.png 768w ,https://thecrow.uk/media/posts/95/responsive/schwertwal-lg.png 1024w ,https://thecrow.uk/media/posts/95/responsive/schwertwal-xl.png 1360w ,https://thecrow.uk/media/posts/95/responsive/schwertwal-2xl.png 1600w\"></figure>\n<p>So far we've printed both the powerstroke and standard models, equipped them with laser pointers, and dialled them in at 150 fps. If you want any oncoming zombies to resemble a porcupine, these will do the job.</p>\n<p>We also printed the ball-bearing chucker for the daughter and equipped it with Theraband Gold elastic resistance fitness band. It can rapid-fire 12mm steel balls at 130 fps. Again, it's unlikely to kill a zombie, but it'll give it a hell of a headache.</p>\n<p>Image credits:</p>\n<p><a href=\"https://unsplash.com/@davieees?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Davide Aracri</a> on <a href=\"https://unsplash.com/photos/a-person-with-a-lot-of-blood-on-the-face-cgF0E2mPjts?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Unsplash</a></p>\n<p><a href=\"https://www.thingiverse.com/thing:892442\">ColorFabb</a> / <span class=\"alt-titles\"><span class=\"tool-identifier\"><a href=\"https://creativecommons.org/licenses/by/4.0/\">CC BY 4.0</a></span></span></p>\n<p><a href=\"https://www.thingiverse.com/thing:3060478\">Super Steve</a> / <span class=\"alt-titles\"><span class=\"tool-identifier\"><a href=\"https://creativecommons.org/licenses/by-nc-sa/4.0/\">CC BY-NC-SA 4.0</a></span></span></p>",
            "image": "https://thecrow.uk/media/posts/95/printpocalypse.png",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Tips",
                   "Hardware",
                   "Cool Things",
                   "3D Printing"
            ],
            "date_published": "2025-04-22T13:39:00+01:00",
            "date_modified": "2025-07-14T14:17:59+01:00"
        },
        {
            "id": "https://thecrow.uk/elegoo-neptune-4-max-large-format-3d-printer-review-at-homeneed-at-home/",
            "url": "https://thecrow.uk/elegoo-neptune-4-max-large-format-3d-printer-review-at-homeneed-at-home/",
            "title": "The giant in the attic - a large format 3D printer is just what you need at home",
            "summary": "Along with high-speed internet access, 3D-printing is one of the surest signs that we're living in the future. Think of something, anything, and within a few hours it can be yours - without you leaving your home, or even having it delivered by a guy&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Along with high-speed internet access, 3D-printing is one of the surest signs that we're living in the future. Think of something, anything, and within a few hours it can be yours - without you leaving your home, or even having it delivered by a guy on a bike.</p>\n<p>Of course, this only applies if the things you want are made out of plastic - and kind of small.</p>\n<p>That first point isn't quite true - metal 3D-printers exist at an eye-watering price point, and there are even some home-made, jury-rigged <a href=\"https://www.youtube.com/watch?v=E9tVj9qJ_ns\" data-md-href=\"https://www.youtube.com/watch?v=E9tVj9qJ_ns\" rel=\"noopener noreferrer nofollow\">metal printers that have been fashioned out of TIG welders</a>, and managed to yield fairly respectable Benchies.</p>\n<p>And the second point isn't true either. There are some truly enormous 3D-printers out there. People have printed full-sized boat hulls, and The Crow could comfortably sit inside an <a href=\"https://us.elegoo.com/pages/elegoo-orangestorm-giga\" data-md-href=\"https://us.elegoo.com/pages/elegoo-orangestorm-giga\" rel=\"noopener noreferrer nofollow\">Elegoo Orangestorm Giga</a>.</p>\n<p>When we first dipped our toes into the world of 3D printing a few years ago, it was to <a href=\"https://thecrow.uk/seizing-the-means-of-production-with-an-anycubic-photon-mono-resin-printer/\">seize the means of production</a> and make own own cool stuff. We went with an AnyCubic Photon Mono resin printer, and it was great for making highly detailed models, fittings, fixtures, odds, and sods.</p>\n<p>But a resin printer comes with its own set of problems that emerge over time: it stinks, it's messy, it <em>is</em> limited to small objects. Slowly, print runs dropped off from daily to weekly, to zero. Years passed until we decided we wanted to make cool things again - but without the limitations of smelly resin.</p>\n<h2>The Elegoo Neptune 4 Max is not small</h2>\n<p>The first thing you'll hear about the Neptune 4 Max from most reviews is that it's huge, that it's a behemoth, that you'll never fit it through your front door, that it will break your dining table.</p>\n<p>This isn't true. It's big, yes, but it's not as big as an armchair or a washing machine. It's probably not even as big as your TV.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/elegoo_neptune_4_max_in_place.png\" alt=\"Large 3D printer on a table in a messy loft\" width=\"1322\" height=\"724\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/elegoo_neptune_4_max_in_place-2xl.png 1600w\"></figure>\n<p>After hauling the box upstairs and unpacking, we had no problem carrying the gantry, build plate and base up a rickety stepladder and through the loft hatch into the space that would later become known as 'The Lair.\" There wasn't much clearance, and it had to go through on a diagonal, but we had no real problems with either the size or weight.</p>\n<p>To us, the Neptune 4 Max feels about as big as a 3D printer <em>should</em> be in order to be of practical use. We can't see any real purpose for having a 100x100 printbed in our lives - or even 200x200. A 300x300 printing surface is acceptable, but the Max's 420x420 combined with a 480mm height feels about right, and gives us the confidence that we can print just about anything for the home.</p>\n<p>Having said that, you'll need a pretty sturdy surface to place it on.</p>\n<h2><br>Assembling the Max is a breeze.</h2>\n<p>There isn't a whole lot to unpacking and assembling the Max, as Elegoo has pre-built as much of the machine as possible, while ensuring it will still fit in a flattish-pack box.</p>\n<p>The gantry and its associated motors, pulleys and wiring is ready to go, and merely needs bolting on to the base unit, and some cables to be connected, along with the filament detector and sail fan (should you choose to use it). The built plate is magnetic, so you can just slap it in place.</p>\n<p>There really isn't that much more to it than that.</p>\n<h2>Setup and first prints</h2>\n<p>As soon as we had assembled the Neptune 4 Max, we we eager to get started - no with some monster project, but just to see if it actually worked, printed a solid model correctly, and if there were any major problems.</p>\n<p>Before we could get started we need to level the bed.</p>\n<p>The process is semi-automatic, and for the most part, involves sliding a piece of paper under the nozzle, using the neato control panel to adjust the print head's position, and adjusting six screws (located around the underside of the bed) until the paper could barely be withdrawn. After that we used to printer's own auto-levelling software to heat the bed to print temperature and test against a grid of 64 points. This is time consuming, so it may be worth making a cup of tea while you wait.</p>\n<p>Suitably refreshed, we inserted the USB stick to inspect the included files. There was a nut cracker, a textured plant pot, a cube, and a Buddha included - each with an estimated print time in the region of one to two hours. We went with the Buddha and the plant pot. The quality was fine - not as good as resin, and llayer lines made it obvious that they had been run off an FDM machine, but good enough.</p>\n<p>We put a spider plant in the pot, and the Buddha sits under the plant on our bathroom windowsill. It's a nice tableau.</p>\n<h2>Fluidd is silky smooth</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/fluidd.png\" alt=\"Fluidd web interface showing a print in progress\" width=\"1920\" height=\"969\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/fluidd-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/fluidd-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/fluidd-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/fluidd-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/fluidd-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/fluidd-2xl.png 1600w\"></figure>\n<p>We've not used the supplied USB stick since completing our first Buddha and plant pot combo. Instead, we sit in the living room and send gcode up the the Max over WiFi. The Fluidd interface is slick and shows all the vital stats of the printer: time elapsed, time remaining (according to both the slicer and the printer), various thermals, print head location on all three axes, and more.</p>\n<p>There's a list with all the files that have printed recently, making it super easy to prit again with the same settings, and you can even inspect the Gcode layer by layer. Sweet!</p>\n<p>If you're of a mind to, and we were, you can connect a webcam to one of the USB ports to monitor what's going on.</p>\n<h2>Using a webcam with the Elegoo Neptune 4 Max</h2>\n<p>Monitoring your print is important. Accidents happen, and while you're happily in another room, your printer could be spitting filament all over the place. The print may come unstuck from the base or it may be on fire. You need to know.</p>\n<p>The Max runs Linux under the hood - Armbian to be specific - which means that connecting via SSH with default credentials is a doddle, and starting the camera service barely less so.</p>\n<p>With that out of the way, we hung the camera from the roof using a quickly designed and newly printed bracket and plugged the cable directly into the USB port. If you're likely to use the USB port to upload print files to the Max, you'll probably want a USB hub.</p>\n<p>Back over in Fluidd, the video feed showed up straight away in top right corner - meaning we could watch our print in action so long as we're in the house.</p>\n<p>But what about when we're out and about? The Crow doesn't solely reside in a comfy recliner in the living room, and when we're browsing bargains in the middle of Lidl, there's often a nagging fear that our print job has run out of control and is, as we peruse the cheese selection filling the interior of the loft with orange plastic.</p>\n<p>While it's easy to expose Fluidd's interface to the web, it's probably not a great idea to do that. Sure, Fluidd has auth controls, and we've no reason to doubt they're effective, but unlike many web services, an attacker can use your 3D printer to cause fires and kill you. It isn't worth the risk.</p>\n<p>Instead, we located the cam feed on port 8080, created a new subdomain, and proxied through Apache on our main server. Of course, the Max's Armbian system would serve perfectly well as a complete server in its own right, but use what you have, right?</p>\n<p>Access is secured via htaccess and htpasswd, and even if an attacker manages to get through, what they have is a camera feed, not control.</p>\n<h2>How fast is too fast?</h2>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/failed_print.png\" alt=\"Failed print resulting in meted orange filament over the printbed \" width=\"1920\" height=\"1110\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/failed_print-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/failed_print-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/failed_print-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/failed_print-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/failed_print-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/failed_print-2xl.png 1600w\"></figure>\n<p>Elegoo shipped the Neptune 4 Max with customised Klipper firmware. This has a bunch of implications that we're not going to go into here, but the main one is that the Max is fast. Not two-minute Benchy fast, but 500 mm per second is pretty quick, and acceleration is in the region of 25,000 mm per second.</p>\n<p>This is great, but we found that running it at any higher than 250 mm per second resulted in an unacceptably high print failure rate, and with standard acceleration settings, the noise coming from the bed slinger overhead was atrocious.</p>\n<p>Slow and steady wins the race, and if you want prints to succeed and look decent, while still getting a good night's sleep, you'll want to keep the various speed settings down.</p>\n<h2>What? No Linux?</h2>\n<p>Elegoo ships with its own, customised version of Cura 5.6.0, designed to help users get the best from their printer, and with optimal settings already dialed in to ensure a silky-smooth, trouble-free printing experience.</p>\n<p>At least we imagine that's what it does. We don't know, as while <a href=\"https://github.com/ELEGOO-3D/ELEGOO-Cura5.6.0/releases\" data-md-href=\"https://github.com/ELEGOO-3D/ELEGOO-Cura5.6.0/releases\" rel=\"noopener noreferrer nofollow\">Elegoo has provided binaries for Windows and macOS</a>, it hasn't seen fit to bundle a single AppImage, deb, or rpm. Sure, there's source code tar.gz, so we have the option of compiling ourselves, but it doesn't vibe well with the simplicity and ease-of-use of the rest of the system.</p>\n<p>We can only guess at how the official software actually performs, but in the meantime, are quite happy with stock Cura, which has a perfectly adequate Neptune Max 4 profile.</p>\n<h2>Big prints are a joy to make</h2>\n<p>There's a certain quality and fittingness to bespoke objects that just isn't available from off-the-shelf purchases. but bespoke is expensive, and even if the object in question is constructed by master craftsmen, the result may not be exactly what you had in mind.</p>\n<p>3D-printing means that you can tailor your possessions, and if they're not quite right, tweak them slightly and print a revised version. minor annoyances melt away in the face of 3D-printed fixes.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/cuppa.png\" alt=\"A volksgen mug on a stained blue sliding table mounted on a bed rail\" width=\"1920\" height=\"1020\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/cuppa-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/cuppa-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/cuppa-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/cuppa-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/cuppa-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/cuppa-2xl.png 1600w\"></figure>\n<p>Out bedside cabinet is too far back to comfortably rest a cup of tea on in the morning, and The Crow's spouse takes exception to him resting it on the bed covers. The solution: a sliding mini table- that grips the side of the bed, is perfectly sized for a morning brew, and will slide back when not in use. Likewise, where does one place ones wine glass while in the bath? Propping it against the edge of the bath and the wall has resulted in multiple mishaps, but another mini table, attached to the side of the bath, keeps the Pinot Grigio secure among the bubbles.</p>\n<p>We wouldn't have been able to make it with the Mono.</p>\n<p>Kitchen drawers are a pertpetua battle in the Crows kitchen. What goes where? Drawer dividers can help, but they're never the right size or layout, and even adjustable dividers end up rattling around after a few months.</p>\n<p>Kitchen drawers are big, but with the Max's respectable printbed, we were able to churn out perfect 400 mm x 400 mm units which slide in like a glove, and are solid, stable, and good-looking.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/cutlery.png\" alt=\"A selection of cutlery in a black 3d printed drawer divider\" width=\"1920\" height=\"978\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/cutlery-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/cutlery-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/cutlery-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/cutlery-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/cutlery-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/cutlery-2xl.png 1600w\"></figure>\n<p>How about a wall-mounted wine rack in the dining nook - to save us the epic trek to the imaginary wine cellar? No Problem. A can crusher to save space in your recycling bin? done.</p>\n<p>Moving outside, we now have an attractive and functional lion's head fountain, made using part of an unloved fish tank filter.</p>\n<figure class=\"post__image align-center\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/fountain.png\" alt=\"A lion head fountain spitting water\" width=\"543\" height=\"731\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/fountain-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/fountain-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/fountain-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/fountain-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/fountain-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/fountain-2xl.png 1600w\"></figure>\n<p>It can do small, too. Miniatures aren't up to the standard of a resin printer, but they're certainly not terrible, and once painted, are eminently suitable for tabletop games.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/mini.png\" alt=\"A miniature prited by the Elegoo Neptune 4 Max\" width=\"1920\" height=\"1060\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/mini-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/mini-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/mini-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/mini-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/mini-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/mini-2xl.png 1600w\"></figure>\n<p>I see it, I want it, I print it, I got it.</p>\n<h2>Not entirely smooth sailing</h2>\n<p>Benchy jokes aside, life with the max hasn't been entirely trouble free. The noise from fast prints has caused plenty of marital strife. There's also the fact that printing large objects inevitably leads to some degree of warping as extremities pull themselves from the base plate.</p>\n<p>Some of this can be put down to the fact that a frigid loft in northern England in winter is not the ideal environment for a 3D printer. The base remains hot and the air is cold. The plastic contracts and, well, issues develop.</p>\n<p>This rarely results in complete disaster. Either the print completes but is a bit wonky on one or more corners, or we cut our losses and try again.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/94/borked_extruder.png\" alt=\"Extruder assembly covered in orange gunk\" width=\"1440\" height=\"840\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/94/responsive/borked_extruder-xs.png 300w ,https://thecrow.uk/media/posts/94/responsive/borked_extruder-sm.png 480w ,https://thecrow.uk/media/posts/94/responsive/borked_extruder-md.png 768w ,https://thecrow.uk/media/posts/94/responsive/borked_extruder-lg.png 1024w ,https://thecrow.uk/media/posts/94/responsive/borked_extruder-xl.png 1360w ,https://thecrow.uk/media/posts/94/responsive/borked_extruder-2xl.png 1600w\"></figure>\n<p>In the second week of ownership, however, warpage was so bad that the print head a large, partially printed model from the print bed. The object ended underneath the printer, locking the Y axis in place, and the printer continued to print. This was not ideal, and resulted in the purchase of a new extruder assembly.</p>\n<p> </p>\n<h2>Insanely good value</h2>\n<p>The Elegoo Neptune 4 Max has a list price of £472.99, but there are bargains and deals to be had. We went the eBay route, and bought from the official Elegoo eBay store, with a post Christmas voucher, meaning we paid a smidge under £350 for the unit and a tiny amount of filament. On the official website, the max is currently £377.99, s we didn't save a tonne of cash.</p>\n<p>It's not a cheap purchase, but it's not bank-burstingly expensive either.</p>\n<p>You should buy one.</p>",
            "image": "https://thecrow.uk/media/posts/94/elegoo_neptune_4_max.jpeg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Stuff",
                   "Hardware",
                   "Cool Things",
                   "3D Printing"
            ],
            "date_published": "2025-01-11T11:11:00+00:00",
            "date_modified": "2025-07-11T13:01:18+01:00"
        },
        {
            "id": "https://thecrow.uk/gamelofts-the-oregon-trail-is-a-fun-time-suck/",
            "url": "https://thecrow.uk/gamelofts-the-oregon-trail-is-a-fun-time-suck/",
            "title": "Gameloft&#x27;s The Oregon Trail is a fun time-suck",
            "summary": "We were sad when Nora died. We'd enjoyed spending time with her for over a month, across a journey of several hundred miles, she'd proven herself to be the best of people. A missionary by trade, Nora was kind and competent. She could negotiate a&hellip;",
            "content_html": "<div class=\"post__entry u-inner\">\n<p data-pm-slice=\"1 1 []\">We were sad when Nora died. We'd enjoyed spending time with her for over a month, across a journey of several hundred miles, she'd proven herself to be the best of people.</p>\n<p>A missionary by trade, Nora was kind and competent. She could negotiate a bargain, tend wounds, and find her way through the wilderness.</p>\n<p>Essentially, Nora was the glue that held the group together. She was its lynchpin, and once she was gone - buried beneath a randomly generated epitaph after succumbing to afever after an infected wound - the party disintegrated.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/nora_tombstone-md.webp\" alt=\"A tombstone reading: Beloved Nora. Beyond the far horizon lies dreams\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/nora_tombstone-md-2xl.webp 1600w\"></figure></figure>\n<p>Elias died from a self-inflicted gunshot wound; Daisy was washed away downstream while fording a river; John was run over by his own wagon.</p>\n<h2>The Oregon trail traces a path through US history</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/oregon_trail_map_blue_mountains_nez_perce-md.webp\" alt=\"Oregon tail map showing the section between the Blue Mountains and Nez Perce\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_map_blue_mountains_nez_perce-md-2xl.webp 1600w\"></figure></figure>\n<p>If you're over the age of 40, you've probably played The Oregon Trail before. It was created in the early 1970s as a way of engaging pre-adolescent schoolchildren with the harsh realities of life on the pioneer route from the misery of Missouri to the promised land on what would later become the US east coast.</p>\n<p>The game mechanics are simple. It's essentially a mix of lightweight management sim, and a series of minigames you play to keep your party alive through random and fixed events as you travel between objectives on a map.</p>\n<p>Starting in the town of Independence, you pick your party members, buy a wagon and supplies, then set off on your journey westward.</p>\n<p>You'll choose what route to take, and need to make decisions on how to survive. Clean shirts, medicine, and harmonicas will keep the party hygienic, healthy, and happy but take up space in the wagon. They'll also disappear as they're used, and become damaged as your wagon cover decays. Wagon repair kits are in short supply once you hit the trail, but can be bartered for at major landmarks and forts.</p>\n<p>While you start off with some basic foodstuffs, you'll need to kill to survive once you're away from civilization: hunting requires bullets (and a knife if you want to keep the pelts); fishing requires bait. The result is a bunch of fun minigames that serve to keep you alive, while providing tradeable resources. There are other random encounters and minigames, too, but we'll leave them as a surprise.</p>\n<h2>Pixels and parallax on the Oregon trail</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/oregon_trail_blue_mountains-md.webp\" alt=\"Oregon Trail party with four member heading uphill into snow. There is a rock in the foreground\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_blue_mountains-md-2xl.webp 1600w\"></figure></figure>\n<p>Being created to run on HP 2100 minicomputermore than half a century ago, Oregon Trail graphics were rudimentary to the point of non-existence, and later versions weren't much better - even as they leaned towards colour, and figures that could be recognised as human. Or a Wagon. Or a bird.</p>\n<p>The most recent iteration of the game acknowledges this heritage with a distinctly pixel-art style, and sprite animation that you think you remember from the 1990s, but which is actually much, much, better.</p>\n<p>The trail moves beneath your feet, with the characters and their wagon staying more-or-less centre screen, but you can really get a sense of distance travelled thanks to parallax scrolling - meaning that the background, middle, and foreground move at a different rate.</p>\n<p>For a pixel art style retro gaming experience, this is perfect, and harks back the late 1990s and the days of the Amiga 1200 (for which The Oregon Trail was never released).</p>\n<p>Minigames are simple and fun, and with the kind of no-clip action you'd expect from pre-millenium platforms.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/hunting_in_oregon_trail-md.webp\" alt=\"A lone hunter standing in a snowy clearing with a rifle in her hands. There are two dead bears and a live bear escaping\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/hunting_in_oregon_trail-md-2xl.webp 1600w\"></figure></figure>\n<p>Landmarks, forts, and campsites, are all beautifully drawn, coloured, and animated, and the game is overflowing with factual tidbits, historical information, and fun anecdotes. You can \"collect\" animals by clicking on them as they appear on your route, and you'll actual <em>learn</em> stuff as you progress through the game.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/oregon_trail_fish_journal-md.webp\" alt=\"Oregon Trail journal showing rare fish caught\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/oregon_trail_fish_journal-md-2xl.webp 1600w\"></figure></figure>\n<p>The 2022 version of the Oregon Trail is produced by Gameloft in Collaboration with the publisher Harper Collins, using the Unreal Engine.</p>\n<h2>Different American perspectives</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/93/native_map-md.webp\" alt=\"Oregon trail map showing two native villages\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/93/responsive/native_map-md-xs.webp 300w ,https://thecrow.uk/media/posts/93/responsive/native_map-md-sm.webp 480w ,https://thecrow.uk/media/posts/93/responsive/native_map-md-md.webp 768w ,https://thecrow.uk/media/posts/93/responsive/native_map-md-lg.webp 1024w ,https://thecrow.uk/media/posts/93/responsive/native_map-md-xl.webp 1360w ,https://thecrow.uk/media/posts/93/responsive/native_map-md-2xl.webp 1600w\"></figure></figure>\n<p>The Oregon Trail is a history of the great American expansion, and through most of its history of has been an interactive storytelling experience of white men and women heading west.</p>\n<p>This version is different. In addition to a variety of trails and seasons you can traverse as the ever-marching face of expansion, you'll also get to play as the people who were originally there. On Winter Migration trail, for instance, you'll take the role of a Native American mother and son, who must reach the hunting grounds before winter sets in. Unlike the main game, you won't have a wagon, and consequentially, very little room for provisions.</p>\n<p>This isn't the only nod to the diversity of people populating the old west. While your party may be composed of racially diverse characters, Conversations with NPCs will tell you that Black people won't be permitted to settle in Oregon. May as well stay at home. Right?</p>\n<h2>The Linux Trail</h2>\n<p>Similar to the Oregon Trail itself, getting to Oregon on Linux isn't quite as simple as hopping on a train or plane to your destination.</p>\n<p>Despite the many platforms for which the game has been published over the past half-century, it has never been officially made available for Linux.</p>\n<p>This doesn't mean it's difficult to install or run, though. Gameloft's The Oregon Trail is available on Steam or <a href=\"https://www.gog.com/en/game/the_oregon_trail\" data-md-href=\"https://www.gog.com/en/game/the_oregon_trail\" rel=\"noopener noreferrer nofollow\">DRM-free on Gog</a> for £24.99.</p>\n<p>In the former case, you'll be able to use Steam's Proton to play the game, and in the latter case, we installed and launched with the Heroic Games launcher for flawless performance.</p>\n<p>£25 is a high price for a game that's changed little over the past 50 years, but there's a huge amount of additional content, and even the main trail will keep you occupied for more than a day.</p>\n<h2>There are games even older than The Oregon Trail</h2>\n<p>If the Oregon trail has you yearning for the simpler gaming experience of years gone by, but you don't have a time machine (or an emulator) to hand, you can try out Colossal Cave Adventure - the first text adventure game ever made.</p>\n</div>",
            "image": "https://thecrow.uk/media/posts/93/oregon_trail-2xl.webp",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Gaming"
            ],
            "date_published": "2024-08-31T14:11:00+01:00",
            "date_modified": "2025-07-09T14:16:07+01:00"
        },
        {
            "id": "https://thecrow.uk/fallout-london-running-well-linux-review/",
            "url": "https://thecrow.uk/fallout-london-running-well-linux-review/",
            "title": "Fallout London may be be the best entry in the series - and it&#x27;s great on Linux",
            "summary": "Fallout 4 - while fun to play - was disappointing. It offered a lightweight, Disneyfied version of the post-apocalyptic word, seemingly aimed squarely at console gamers and kids. Unlike previous entries in the series, it wasn't really possible to exist in the wasteland as a&hellip;",
            "content_html": "<div class=\"post__entry u-inner\">\n<p data-pm-slice=\"1 1 []\">Fallout 4 - while fun to play - was disappointing. It offered a lightweight, Disneyfied version of the post-apocalyptic word, seemingly aimed squarely at console gamers and kids.</p>\n<p>Unlike previous entries in the series, it wasn't really possible to exist in the wasteland as a terrible human being, and the player character was given too much, too soon. It was surprisingly difficult to die in the early stages of the game, and the wasteland felt inappropriately hopeful.</p>\n<p>Fallout London - the long-awaited, game-sized mod from Team Folon isn't like that at all, and after a gratifyingly brief character creation process, we died by fire several times in the opening few minutes. Stimpacks? Guns? NIghtsticks? They're not around. It's you and your fists for the first hour. Future London feels dark, grim, and desperate in a way that the base game is not, but that is entirely appropriate for a game set in the aftermath of a nuclear holocaust.</p>\n<p>We're going to skip over the installation process - suffice it to say that we found installing Fallout London on Linux to be a complete ballache that took up an entire afternoon, and failed for seemingly random reasons. If you're used to gaming on Linux, you'll be used to the various workarounds and counterintuitive actions you need to take in order to get Windows software running well.</p>\n<p>These are our impressions of Fallout London after a few days on play.</p>\n<h2 id=\"h-the-london-look\">The London look</h2>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/amstrad.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/amstrad-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/amstrad-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/amstrad-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/amstrad-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/amstrad-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/amstrad-2xl.webp 1600w\" alt=\"A desktop computer with trackball\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>While America was stuck in the nuclear-powered 1950s, England seems to have progressed to the 1980s, or possibly the early 1990s. The computers are reminiscent of Amstrad units, and have trackballs, as well as speakers embedded in the monitors. Abandoned police cars look like something you'll have seen on The Bill back in the day, and there are even pink wafer biscuits to add to the aesthetic of this writer's youth.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/pink_panther_biscuits.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/pink_panther_biscuits-2xl.webp 1600w\" alt=\"Pink wafer biscuits\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Sarcastic and often cruel replies that made dialogue in 1, 2, and New Vegas so much fun to play was missing in the borderline-PG Fallout 4, in which everyone is earnest and decent - spelling them out to you every opportunity. Witty banter is back again in Fallout London - and even more sweary. In addition to the casual A-list curses, the British slang feels just about right. We recognise and use some terms, ourselves and we're fairly sure overseas players will be able to work most of it out without resorting to Urban Dictionary.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/pub_interior.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/pub_interior-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/pub_interior-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/pub_interior-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/pub_interior-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/pub_interior-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/pub_interior-2xl.webp 1600w\" alt=\"The interior of a typical British pub\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>The buildings seem authentically London, and walk into the Ship and Mitre, and you'll immediately recognise it as an English pub. It's great. All the major landmarks are there, and often plot essential. Saint Paul's Cathedral, the Millennium Dome, Houses of Parliament, Nelson's Column. It's a lot.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/sunset_over_london.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/sunset_over_london-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/sunset_over_london-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/sunset_over_london-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/sunset_over_london-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/sunset_over_london-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/sunset_over_london-2xl.webp 1600w\" alt=\"London from the top of Nelso's column - overlooking St Paul's cathedral at sunset\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>That litter bin in the picture below? There's an identical one less than 100 yards from where we're sitting right now.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/bin.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/bin-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/bin-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/bin-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/bin-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/bin-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/bin-2xl.webp 1600w\" alt=\"A black metal bin with gold highlights\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>And there are traditional British corner shops with names like Morrisingh's, Singhsburys, and Singhsbury's Local. Inside every one of them, you'll find a skeleton in a turban. There are post boxes that are visually similar to the ones around the corner from the Linux Impact offices. Do not go near them.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/post_boxer.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/post_boxer-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/post_boxer-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/post_boxer-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/post_boxer-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/post_boxer-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/post_boxer-2xl.webp 1600w\" alt=\"A motorised postbox with saws and wheels\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>And what could be more British than a laundrette? Dot Cotton - eat your heart out.</p>\n<p>Character-wise, you'll see exaggerated versions of the type of people London calls to mind when folk from outside the smoke think of the place. There are the Beefeaters - cannibalistic stand-ins for supermutants; the gents who are your typical London gents,</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/ferryman.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/ferryman-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/ferryman-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/ferryman-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/ferryman-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/ferryman-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/ferryman-2xl.webp 1600w\" alt=\"a boat steered by a ferryman with green skin\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Two exceptions here are the Thamesfolk - a semi-aquatic object lesson in what happens when you live in and on a polluted waterway, and Hooligans - who go out wearing footie shirts and exist only to give you grief ad beat you up for no obvious reason. They seem about right, and you can probably spot a group if you venture to the capital today.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/miggins.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/miggins-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/miggins-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/miggins-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/miggins-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/miggins-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/miggins-2xl.webp 1600w\" alt=\"Fallout menu showing a variety of pies in the inventory of Miss Miggins \" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Get a haircut from Sweeney Todd, then a pie from Miss Miggins next door.</p>\n<h2 id=\"h-the-gameplay\">The Gameplay</h2>\n<p>Where Fallout 4 coddles you, London cripples you, and you start the main mission with a couple of serious debuffs, due to your origins as a lab rat, and a subsequent railway accident - leaving you to take more damage and deal less.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/rad_damage.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/rad_damage-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/rad_damage-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/rad_damage-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/rad_damage-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/rad_damage-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/rad_damage-2xl.webp 1600w\" alt=\"pov of a river with the character taking 250 rads per second damage\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Large areas of the city are flooded. Sure, you can swim, but you'll be sucking down 250 rads per second while you're doing it. Even dosing yourself with Rad-X and using a prophylactic Jimmy hat won't prevent your health bar from flooding red and killing you in a matter of seconds.</p>\n<p>Once you're in the world, weapons are fairly easy to come by. You're given a sweet and lethal butterfly knife by one of the first named NPCs you meet, and local hooligans can be relieved of their Boxcutters, bats, and other weapons easily enough. The Butterfly knife -- named Balisong by the way -- has its own neat idling animation. How distracting you'll find it will vary.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/london_bus_knife-2.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/london_bus_knife-2-2xl.webp 1600w\" alt=\"Twirling a butterfly knife on the top deck of a London bus\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Like to kill from a distance? There's no shortage of guns or ammo, and although the game tends to push you more towards knives (as in the real London), it will make sure you have a gun in your hand when you need one - such as a set-piece shootout on the river.</p>\n<figure class=\"post__image\"><img loading=\"lazy\" src=\"https://linuximpact.com/media/posts/96/rifle.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://linuximpact.com/media/posts/96/responsive/rifle-xs.webp 300w, https://linuximpact.com/media/posts/96/responsive/rifle-sm.webp 480w, https://linuximpact.com/media/posts/96/responsive/rifle-md.webp 768w, https://linuximpact.com/media/posts/96/responsive/rifle-lg.webp 1024w, https://linuximpact.com/media/posts/96/responsive/rifle-xl.webp 1360w, https://linuximpact.com/media/posts/96/responsive/rifle-2xl.webp 1600w\" alt=\"\" width=\"1920\" height=\"1080\" data-is-external-image=\"true\"></figure>\n<p>Missions are often your usual fetch quests as you work towards a goal, but they've not been too onerous in the ten or so hours I've put in so far. One exception to this was trying to find an NPC in the dark in a flooded area by torchlight. Instadeath Ragequit.</p>\n<p>While in Fallout 4, we could run through the game on survival mode and complete the (a) main questline in a few hours, there's no chance of doing that in London. If we have paid for the mod, we'd have felt we were getting our moneys worth. We're ten hours in, and have only just managed to get back into the Angel lab.</p>\n<h2 id=\"h-the-bugs\">The bugs</h2>\n<p>Bethesda games are notorious for buggy gameplay and glitches, and Fallout London is surprisingly bug free.</p>\n<p>We've had only a couple of crashes to desktop across the few days we've been playing. Infinite loading times were taken care of by a mod.</p>\n<p>Gameplay-wise, we've seen few areas which made us think that this was anything less than a perfectly honed and polished top tier title.</p>\n<p>The first was after the aforementioned gunfight on the river. If we didn't leap from the boat at exactly the right moment, we'd end up in the water in a second, and dead in two. The second is when equipped with the gask mask, we'd get debugging messages in the top left of the screen stating \"Im in first person\" and \"Im in 3rd person.\" Really no big deal. If you've followed the instructions and use Heroic games launcher, you shouldn't have many - if any-problems.It's awesome, it's awe-inspiring, and it's astonishing that this was made by volunteers up against obstacles seemingly put in their way by Bethesda. </p>\n</div>",
            "image": "https://thecrow.uk/media/posts/92/fallout_london_main_menu-2xl.webp",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Software",
                   "Gaming"
            ],
            "date_published": "2024-08-02T14:03:00+01:00",
            "date_modified": "2025-07-09T14:06:10+01:00"
        },
        {
            "id": "https://thecrow.uk/markdowndown-lets-you-easily-convert-web-pages-to-markdown/",
            "url": "https://thecrow.uk/markdowndown-lets-you-easily-convert-web-pages-to-markdown/",
            "title": "Markdowndown lets you easily convert web pages to Markdown",
            "summary": "Take a look at the HTML of any web page, and you'll see it's an almost incomprehensible mess. Sure, with some practice you can probably make sense of it, but its hardly intuitive, and it's definitely not a pleasant experience. In contrast, Markdown is a&hellip;",
            "content_html": "<p data-pm-slice=\"1 1 []\">Take a look at the HTML of any web page, and you'll see it's an almost incomprehensible mess. Sure, with some practice you can probably make sense of it, but its hardly intuitive, and it's definitely not a pleasant experience.</p>\n<p>In contrast, Markdown is a lightweight markup language that is used to format text. It allows you to create formatted documents using plain text with simple syntax. You can use it to easily create web pages, and in fact, this very website is written using Markdown before being converted to HMTL by <a href=\"https://thecrow.uk/want-to-easily-create-a-good-looking-website-in-minutes-this-is-how/\">Publii - our favorite static site generator</a>. If we had a mind to, we could convert our Markdown file to PDF, Docx, or.... anything really.</p>\n<p>Aside from its readability, Markdown has other advantages, too. Web pages can be huge, with massive chunks of unnecessary JavaScript, tracking code, and other such cruft, which can rapidly fill up your storage if you're in the habit of downloading them for later perusal.</p>\n<p>A nice, neat Markdown file takes up almost no space at all, while preserving formatting and being easily readable - even without a dedicated Markdown viewer.</p>\n<h2 id=\"h-need-to-convert-html-to-markdown-theres-a-self-hosed-app-for-that\">Need to convert HTML to Markdown? There's a self-hosted app for that!</h2>\n<p>If, like us, you regularly save web pages locally for you own archival purposes, you're probably dissatisfied with the way they display, and converting to Markdown by hand is time-consuming and fiddly.</p>\n<p>Fortunately, it's simple to spin up Markdowndown, a self-hosted web app, which will convert any page to a clean Markdown file, with the option to download images as well, and have everything packaged neatly as a zip file.</p>\n<p>And because, everything seems to come with some kind of AI integration these days, Markdowndown has an option to pass the Markdown to ChatGPT and have it perform useful tasks such as creating a TL;DR summary.</p>\n<h2 id=\"h-how-to-install-markdowndown-on-linux\">How to install Markdowndown on Linux</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/91/clone_markdowndown_git_repository-md.webp\" alt=\"linux terminal showing commands and output from cloning markdowndown github repository\" width=\"768\" height=\"269\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-xs.webp 300w ,https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-sm.webp 480w ,https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-md.webp 768w ,https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-lg.webp 1024w ,https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-xl.webp 1360w ,https://thecrow.uk/media/posts/91/responsive/clone_markdowndown_git_repository-md-2xl.webp 1600w\"></figure></figure>\n<p>Markdowndown is written in JavaScript, so make sure you have <a href=\"https://thecrow.uk/how-to-install-specific-npm-and-node-versions-on-linux/\">Node Package Manager and Node.js</a> installed before you start. Markdowndown requires node.js version 18.17.0 or above to run.</p>\n<p>With that out of the way, open a terminal and clone the repository, and use the cd command to move into the new directory:</p>\n<pre><code class=\"language-bash\">git clone https://github.com/asadm/markdowndown.git &amp;&amp; cd markdowndown</code></pre>\n<p>Install Markdowndown with:</p>\n<pre><code class=\"language-bash\">npm install</code></pre>\n<p>...and start it with</p>\n<pre><code>npm run dev</code></pre>\n<p>The server will start almost instantly, so open a web browser and navigate to <strong>http://localhost:3000</strong>.</p>\n<h2 id=\"h-use-markdowndown-to-quickly-convert-your-favourite-web-pages-to-markdown\">Use Markdowndown to quickly convert your favourite web pages to Markdown</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/91/markdowndown_web_interface-md-2.webp\" alt=\"Markdowndown web interface\" width=\"768\" height=\"343\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-xs.webp 300w ,https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-sm.webp 480w ,https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-md.webp 768w ,https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-lg.webp 1024w ,https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-xl.webp 1360w ,https://thecrow.uk/media/posts/91/responsive/markdowndown_web_interface-md-2-2xl.webp 1600w\"></figure></figure>\n<p>One of our favourite articles on Linux Impact is a November 2023 piece in which we repurposed a <a href=\"https://thecrow.uk/cheap-portable-retro-gaming-with-a-hated-handheld/\">Leapfrog Leapster as a retro gaming handheld</a>. It's awesome, and we want a copy of the article in Markdown for our files.</p>\n<p>Simply copy the URL, and paste it into the text box of your local Markdowndown instance, and press convert, to get a handy, beautifully formatted Markdown version of the page, focussing on the content, without any of the related articles, navigation features or anything else you don't want.</p>\n<p>If you tick the box to download images locally, you'll need to specify where the images should be stored, and choose to override the base URL in the Markdown, so your viewer or converter doesn't try and fetch them from the web.</p>\n<p>The last checkbox is to get ChatGPT involved, and you'll need an OpenAI API key to use this feature. Should you wish to use it, you'll have the option of using ChatGPT 3.5 or 4 to fiddle with your text.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/91/retro_markdown-md-2.webp\" alt=\"Screenshot an article from The Crow rendered as Mardown\" width=\"768\" height=\"521\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-xs.webp 300w ,https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-sm.webp 480w ,https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-md.webp 768w ,https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-lg.webp 1024w ,https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-xl.webp 1360w ,https://thecrow.uk/media/posts/91/responsive/retro_markdown-md-2-2xl.webp 1600w\"></figure></figure>\n<p>Fetching, formatting, and packaging our Markdown and images took about a second. We rendered it in <a href=\"https://thecrow.uk/marktext-is-the-beautiful-cross-platform-markdown-editor-youve-been-looking-for/\">our favourite Markdown editor</a>, and as you can see in the screenshot, it looks great.</p>\n<h4>Image credit:</h4>\n<p><a href=\"https://unsplash.com/@zanlazarevic?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Zan Lazarevic</a> on <a href=\"https://unsplash.com/photos/person-using-computer-keyboard-X_JsI_9Hl7o?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Unsplash</a></p>",
            "image": "https://thecrow.uk/media/posts/91/zan-lazarevic-X_JsI_9Hl7o-unsplash.jpg",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Software",
                   "Self-hosting",
                   "Markdown"
            ],
            "date_published": "2024-07-06T13:54:00+01:00",
            "date_modified": "2025-07-09T14:01:14+01:00"
        },
        {
            "id": "https://thecrow.uk/great-classic-games-you-can-play-in-your-linux-terminal/",
            "url": "https://thecrow.uk/great-classic-games-you-can-play-in-your-linux-terminal/",
            "title": "Great classic games you can play in your Linux terminal",
            "summary": "Think the Linux terminal is a place for dweebs who can't get girl/boyfriends? Think again. While gaming in the Linux terminal won't win any prizes for outrageously good graphics - you can run these games even on low-resource systems. While gaming fads have come and&hellip;",
            "content_html": "<div class=\"post__entry u-inner\">\n<p data-pm-slice=\"1 1 []\">Think the Linux terminal is a place for dweebs who can't get girl/boyfriends? Think again. While gaming in the Linux terminal won't win any prizes for outrageously good graphics - you can run these games even on low-resource systems. </p>\n<h2 id=\"h-minesweeper\" data-pm-slice=\"1 1 []\">Minesweeper</h2>\n<p>While gaming fads have come and gone in the decades since home computers first appeared on the scene, <a href=\"https://linuximpact.com/tui-mines-is-classic-minesweeper-action-in-a-linux-terminal/\">minesweeper</a> - in various forms - has endured almost untouched, and the Microsoft classic has multiple open-source clones available available for you to install on Linux.</p>\n<p>While some of these come with a GUI, our favourite is tui-mines, which gives you a natty Terminal User Interface (TUI), that looks fantastic if you use <a href=\"https://linuximpact.com/relive-the-glory-days-of-crt-monitors-with-cool-retro-term/\">Cool Retro Terminal</a> instead of your usual white on black text. If you prefer, you can use the terminal emulator that comes bundled with tui-mines. It's up to you, really.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/90/tui-crt-md.webp\" alt=\"TUI mines in a pseudo CRT terminal \" width=\"768\" height=\"468\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/90/responsive/tui-crt-md-xs.webp 300w ,https://thecrow.uk/media/posts/90/responsive/tui-crt-md-sm.webp 480w ,https://thecrow.uk/media/posts/90/responsive/tui-crt-md-md.webp 768w ,https://thecrow.uk/media/posts/90/responsive/tui-crt-md-lg.webp 1024w ,https://thecrow.uk/media/posts/90/responsive/tui-crt-md-xl.webp 1360w ,https://thecrow.uk/media/posts/90/responsive/tui-crt-md-2xl.webp 1600w\"></figure></figure>\n<p>One of the reasons we love tui-mines is that as well as boasting three difficulty levels and Discord integration, you can set the minefield to any size you choose. Find and detonate mines in a puddle, a lake, or across an entire ocean!</p>\n<h2 id=\"h-colossal-cave-adventure\">Colossal Cave Adventure</h2>\n<p>What could be more suited to a Linux terminal than a text adventure?</p>\n<p><a href=\"https://linuximpact.com/play-the-first-ever-text-adventure-game-in-your-linux-terminal/\">Colossal Cave adventure</a> has the honour of being the first text adventure ever, and sees you deposited in a colossal cave filled with enemies and loot. The aim is simple, grab the loot, slay the enemies, and escape.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/90/colossal-ibm-md.webp\" alt=\"Colossal Cave adventure on an antique IBM screen\" width=\"768\" height=\"384\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-xs.webp 300w ,https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-sm.webp 480w ,https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-md.webp 768w ,https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-lg.webp 1024w ,https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-xl.webp 1360w ,https://thecrow.uk/media/posts/90/responsive/colossal-ibm-md-2xl.webp 1600w\"></figure></figure>\n<p>The game was originally meant to be played on teletype printers, and there's even a full 3D version available if that's your bag.</p>\n<p>We think it's best in the terminal, though.</p>\n<h2 id=\"h-roulette\">Roulette</h2>\n<p>Everyone likes a flutter every now and again, but if the prospect of losing real money on the spin of a wheel terrifies rather than excites you, maybe you should stay off the betting sites and out of the casinos.</p>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/90/terminal-roulette-gameplay-md.webp\" alt=\"Terminal roulette graphics\" width=\"768\" height=\"227\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-xs.webp 300w ,https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-sm.webp 480w ,https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-md.webp 768w ,https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-lg.webp 1024w ,https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-xl.webp 1360w ,https://thecrow.uk/media/posts/90/responsive/terminal-roulette-gameplay-md-2xl.webp 1600w\"></figure></figure>\n<p><a href=\"https://linuximpact.com/terminal-roulette-is-a-classic-casino-game-in-your-terminal/\">terminalroulette</a> is, as the name suggests, a game of roulette that you play in your Linux terminal.</p>\n<p>It's simple, it's fun, and you can lose thousands of dollars without actually losing the shirt off your back.</p>\n<h2 id=\"h-emulate-a-complete-console-in-your-terminal\">Emulate a complete console in Your Terminal!</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/90/linux_terminal_game_boy-md.webp\" alt=\"Teenage Mutant ninja turtles played on an emulator in the Linux terminal\" width=\"768\" height=\"384\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-xs.webp 300w ,https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-sm.webp 480w ,https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-md.webp 768w ,https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-lg.webp 1024w ,https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-xl.webp 1360w ,https://thecrow.uk/media/posts/90/responsive/linux_terminal_game_boy-md-2xl.webp 1600w\"></figure></figure>\n<p>If these three aren't enough for you, it's possible to <a href=\"https://linuximpact.com/emulate-game-boy-in-the-linux-terminal/\">emulate the original Game Boy in your Linux Terminal</a> with PHP. There are thousands of games For the original Game Boy, meaning you'll never need to leave the command line again!</p>\n</div>\n<h4>Image credit:</h4>\n<p><a href=\"https://unsplash.com/@mateovrb?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Mateo</a> on <a href=\"https://unsplash.com/photos/black-keyboard-nCU4yq5xDEQ?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Unsplash</a></p>",
            "image": "https://thecrow.uk/media/posts/90/rgb-keyboard-2xl.webp",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Terminal",
                   "Software",
                   "Linux",
                   "Gaming"
            ],
            "date_published": "2024-06-22T13:39:00+01:00",
            "date_modified": "2025-07-09T14:02:37+01:00"
        },
        {
            "id": "https://thecrow.uk/marktext-is-the-beautiful-cross-platform-markdown-editor-youve-been-looking-for/",
            "url": "https://thecrow.uk/marktext-is-the-beautiful-cross-platform-markdown-editor-youve-been-looking-for/",
            "title": "MarkText is the beautiful cross-platform Markdown editor you&#x27;ve been looking for",
            "summary": "Markdown is a near-perfect way to create formatted documents - existing between the two extremes of a bare, naked text file, and a fully fledged word processor such as LibreOffice or Microsoft Word. It's a nice middle-ground to sit in. Often, a multi-gigabyte word processing&hellip;",
            "content_html": "<div class=\"post__entry u-inner\">\n<p data-pm-slice=\"1 1 []\">Markdown is a near-perfect way to create formatted documents - existing between the two extremes of a bare, naked text file, and a fully fledged word processor such as LibreOffice or Microsoft Word.</p>\n<p>It's a nice middle-ground to sit in. Often, a multi-gigabyte word processing package is overkill for preparing the minutes of your local council meeting, but a text file lacks the ability to add images, titles, tables, or anything else beyond plain text.</p>\n<p>Markdown, on the other hand allows you to do some serious formatting, plan great layouts, embed images, and create a great looking document. And you can create Markdown in any basic text editor you choose.</p>\n<p>Of course, Markdown has its drawbacks - the main one being that you need a Markdown viewer to see the formatting in all its glory. Or you need to convert it to another format, such as HTML or PDF. It's a format for writing rather than reading, and what you see in your notes app isn't how it will be presented to the reader.</p>\n<h2 id=\"h-marktext-is-a-multi-mode-markdown-editor-and-viewer-for-distraction-free-writing\">MarkText is a multi-mode Markdown editor and viewer for distraction-free writing</h2>\n<figure class=\"post__image\"><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://thecrow.uk/media/posts/89/marktext_themes-md.webp\" alt=\"Marktext with themes picker open\" width=\"768\" height=\"432\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-xs.webp 300w ,https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-sm.webp 480w ,https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-md.webp 768w ,https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-lg.webp 1024w ,https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-xl.webp 1360w ,https://thecrow.uk/media/posts/89/responsive/marktext_themes-md-2xl.webp 1600w\"></figure></figure>\n<p>Just because you can write Markdown in nano doesn't mean that you should. Often, you'll want to see how the text is going to appear to the reader, and honestly, writing in nano isn't a lot of fun.</p>\n<p>Dedicated Markdown editors offer you a preview of your Markdown as you write it, and of the dozens we've tried, MarkText is our favourite.</p>\n<p>In addition to real-time rendering, MarkText supports a range of Markdown flavours, including Pandoc, GitHub, and CommonMark, as well as KaTeX, front matter and emojis - if you're the kind of person who likes to include emojis in documentation.</p>\n<p>While MarkText doesn't have an especially lengthy features list, some of the things you'll definitely appreciate include the ability to paste images directly from the clipboard, and a variety of light and dark themes to prevent eye strain and keep you focussed on writing without distractions</p>\n<p>While you can write directly using MarkDown in MarkText's \"Source Code\" mode, the software offers two more modes that may better suit your style.</p>\n<p>Typewriter mode lets you furiously tap out your novel or article, with the text of the page moving so that your cursor stays in the same position.</p>\n<p>Focus mode, dims the page except the text you're currently working on</p>\n<p>You can also combine the modes.</p>\n<h2 id=\"h-install-marktext-for-distraction-free-writing\">Install MarkText on Linux</h2>\n<p>MarkText is available for Windows, MacOS, and of course, Linux.</p>\n<p>To get started visit the <a href=\"https://github.com/marktext/marktext/releases/\" rel=\"noopener noreferrer nofollow\">MarkText GitHub releases</a> page. If you're lucky enough to run a Debian-based system, grab the <strong>marktext-amd64.deb</strong> file, then open a terminal and install it with:</p>\n<p>sudo dpkg -i marktext-amd64.deb</p>\n<p>Otherwise, download the appimage, then make it executable with:</p>\n<pre><code class=\"language-bash\"> sudo chmod +x marktext.AppImage</code></pre>\n<p>You can launch the MarkText AppImage from your Downloads directory with:</p>\n<pre><code class=\"language-bash\">./marktext.AppImage</code></pre>\n<h2 id=\"h-markdown-isnt-just-for-writing\">Markdown isn't just for writing</h2>\n<p>You dont have to be writing documentation or preparing a presentation to take advantage of the simplicity and flexibility that Markdown offers. You can <a href=\"https://thecrow.uk/markdowndown-lets-you-easily-convert-web-pages-to-markdown/\">download web pages as Markdown files</a> for archiving and viewing at your leisure.</p>\n</div>\n<h4>Image credit:</h4>\n<p><a href=\"https://unsplash.com/@patrickian4?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Patrick Fore</a> on <a href=\"https://unsplash.com/photos/black-corona-typewriter-on-brown-wood-planks-0gkw_9fy0eQ?utm_content=creditCopyText&amp;utm_medium=referral&amp;utm_source=unsplash\">Unsplash</a></p>",
            "image": "https://thecrow.uk/media/posts/89/typewriter-2-2xl.webp",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Software",
                   "Linux"
            ],
            "date_published": "2024-06-08T12:41:00+01:00",
            "date_modified": "2025-07-09T14:01:56+01:00"
        },
        {
            "id": "https://thecrow.uk/emulate-classic-game-boy-action-in-the-linux-terminal/",
            "url": "https://thecrow.uk/emulate-classic-game-boy-action-in-the-linux-terminal/",
            "title": "Emulate classic Game Boy action in The Linux Terminal  ",
            "summary": "Nintendo's Game Boy is a smidge older than Linux, with the pocket console making its Japanese debut in 1989. For those of us on the Eastern shores of the Atlantic, the first units appeared on the shelves in late 1990, making them the perfect stocking&hellip;",
            "content_html": "<div class=\"post__entry u-inner\">\n<p data-pm-slice=\"1 1 []\">Nintendo's Game Boy is a smidge older than Linux, with the pocket console making its Japanese debut in 1989. For those of us on the Eastern shores of the Atlantic, the first units appeared on the shelves in late 1990, making them the perfect stocking filler for Christmas that year.</p>\n<p>The initial Linux release came a mere nine months later in September 1991.</p>\n<p>Both platforms have developed almost beyond recognition in the three decades that followed: The original Game Boy was followed by the Game Boy Color, then the Game Boy Advance, the Game Boy Advance SP, and finally the novelty-sized Game Boy Micro, with a form factor that harked back to Nintendo's earlier Game and Watch System.</p>\n<p>Linux, meanwhile, has progressed from a hacked-together kernel to the ever-expanding family of distros that power the internet, desktop computers, and even a line of games-consoles.</p>\n<p>But when it first appeared - mere months after the Game Boy made its debut on these shores, Linux offered users little more than a naked terminal.</p>\n<p>So it seems kind of appropriate to use that monochrome terminal to emulate the monochrome gameplay of the first Game Boy.</p>\n<h2 id=\"h-emulate-a-game-boy-with-php\">Emulate a Game Boy with... PHP?</h2>\n<p>Emulating the original Game Boy isn't a computationally expensive task, and we were running Pokemon ROMs back when we were still convinced that Amiga was the future - proudly waving the bouncy ball banner as the system disappeared beneath the waves.</p>\n<p>Midway through the third decade of the 21st century, you can probably emulate a Game Boy on your electric toothbrush. It's the Doom of consoles - destined to be the benchmark by which the casual excesses of our hardware is judged.</p>\n<p>If you just want a quick couple of rounds of Tetris, it's easy enough to find a browser-based version online - or you can boot up one of the very many conventional Game Boy emulators available with a commercial or open-source licence.</p>\n<p>PHP is a scripting language that appeared on the scene in the 1990s, and back in the day, stood for Personal Home Page. You'd use it to build websites to display pictures of your cats and your kids. Almost 30 years on and PHP has evolved almost beyond recognition. Aside from dumping its association with homebrew web development, later versions added support for object-oriented programming, better database support Unicode, Just-in-time compilation, and a whole raft of optimisations.</p>\n<p>Today, PHP, despite the rather boring rebranding as \"PHP: Hypertext Preprocessor\", powers most sites on the internet including everything built using the WordPress platform - which itself is often used for... personal home pages.</p>\n<p>But it's PHP's usefulness as a relatively lightweight complete language, and the fact it can be executed on the command line, that makes it (kind of ) suitable to build a Game Boy emulator you can play in your terminal.</p>\n<h2 id=\"h-why-emulate-game-boy-games-in-your-terminal-anyway\">Why emulate Game Boy games in your terminal anyway?</h2>\n<p>Browsers are big, hefty things that consume massive amounts of memory. Terminals are usually pretty lightweight.</p>\n<p>Maybe you want to play Mega Man V via SSH on a remote system like a Raspberry Pi while you're installing some self-hosted services, such as <a href=\"https://thecrow.uk/paranoid-and-perplexed-by-plex-privacy-pickle-just-enjoy-jellyfin/\">Jellyfin</a>.</p>\n<p>Perhaps you just think playing Game Boy games in a terminal is cool. You're right. It is.</p>\n<h2 id=\"h-how-to-install-php-terminal-gameboy-emulator-on-linux\">How to install php-terminal-gameboy-emulator on Linux</h2>\n<p><a href=\"https://github.com/gabrielrcouto/php-terminal-gameboy-emulator\" rel=\"noopener noreferrer nofollow\">php-terminal-gameboy-emulator</a> was developed by PHP enthusiast, Gabriel Rodrigues Couto, who has used PHP to start work on projects as diverse as PHP neural network, and even a PHP-based cryptocurrency.</p>\n<p>The Game Boy emulator repository hasn't been updated since 2016, and the Readme states that it's compatible with PHP 5.6, PHP 7, and HHVM (HipHop Virtual Machine).</p>\n<p>PHP 7 is pretty old, and HHVM hasn't supported PHP since 2017. But if you don't fancy installing ancient software on your spanky up-to-date Linux box, we're pleased to tell you that we've tried php-terminal-gameboy-emulator with all versions of PHP from 8.0 up. We ran into no difficulties, and you can proceed with confidence.</p>\n<p>For the easiest way to install the software, you'll need PHP and Composer installed on your system. On Debian-based PCs, you can install these with:</p>\n<pre><code class=\"language-bash\">sudo apt install php-cli git composer</code></pre>\n<p>To get started, open a terminal in the usual way and clone the php-terminal-gameboy-emulator repository, and use the cd command to move into your new directory:</p>\n<pre><code class=\"language-bash\">git clone https://github.com/gabrielrcouto/php-terminal-gameboy-emulator.git &amp;&amp; cd php-terminal-gameboy-emulator</code></pre>\n<p>Now use Composer to install the emulator:</p>\n<pre><code class=\"language-bash\">composer install -o</code></pre>\n<p>The entire process should take no more than a minute.</p>\n<p>we found it useful to create an alias to make it easier to launch the emulator:</p>\n<pre><code class=\"language-bash\">echo -e \"\\nalias php-gameboy='~/php-terminal-gameboy-emulator/bin/php-gameboy'\" &gt;&gt; ~/.bashrc\nsource ~/.bashrc</code></pre>\n<p>We found this to be the most reliable way to install the emulator. Other methods are detailed in the official repository.</p>\n<h2 id=\"h-you-can-play-game-boy-games-in-your-terminal-on-linux\">You can play Game Boy games in your terminal on Linux!</h2>\n<p>Your new terminal-based gameboy emulator accepts the path of a Game Boy ROM as an argument, or will look for ROMs in your current directory. We wanted to play TMNT II - Back from the Sewers, so we entered:</p>\n<p>php-gameboy Teenage\\ Mutant\\ Ninja\\ Turtles\\ -\\ Back\\ From\\ the\\ Sewers\\ (U)\\ [!].gb</p>\n<p>Startup is instant, smooth, and gloriously monochrome.</p>\n<p>As a quick reminder, the original Game Boy had a limit number of buttons. There was a D-Pad for directional control, plus <strong>B</strong>, <strong>A</strong>, <strong>Start</strong>, and <strong>Select</strong>. In contrast, your standard PC keyboard has six rows of keys, and probably a numeric keypad. It's a little overkill for a tiny console, and you'll onnly be using a few of them. These are your standard AWSD for direction, plus comma and period (full stop) for <strong>A</strong> and <strong>B</strong>, with <strong>M</strong> and <strong>N</strong> standing in for <strong>Select</strong> and <strong>Start</strong>.</p>\n<h2>How do Game Boy Games play in the Terminal?</h2>\n<p>We don't have limitless time on our hands, so were only able to test a few games during our coffee break.</p>\n<p>Gameplay was smooth on all the games we tested, although there were some artefacts around the sprites when moving. Naturally, there was no sound.</p>\n<h2 id=\"h-and-if-you-need-some-more-nostalgia\">And if you need some more nostalgia...</h2>\n<p>If we're being honest, the project is more an exercise in showing what the terminal can do, rather than a platform for engaging in serious retro gaming. If your committed the idea of using the command line for games, try these games you can play in your Linux Terminal.</p>\n<p>Alternatively, if you want an emulation station you can take with you anywhere, you can easily <a href=\"https://thecrow.uk/cheap-portable-retro-gaming-with-a-hated-handheld/\">convert a cheap Leapfrog Leapster into a fully featured pocket emulation platform</a></p>\n</div>",
            "image": "https://thecrow.uk/media/posts/88/linux_terminal_game_boy-2xl.webp",
            "author": {
                "name": "David Rutland"
            },
            "tags": [
                   "Terminal",
                   "Software",
                   "Retro",
                   "Linux",
                   "Gaming"
            ],
            "date_published": "2024-05-18T12:34:00+01:00",
            "date_modified": "2025-07-09T12:40:29+01:00"
        }
    ]
}
